<?php
include 'inc.php';
$p = isset($_GET['p']) ? (int)$_GET['p'] : 1;
top_wap('我真的在努力..');

echo '我真的在努力，更新永不止步！<br/>';

$str = '
2011-9-1
1.增加同步功能，可同步其他浏览器的COOKIE和书签;
2.增加底部广告自定义功能;
---------
2011-8-29
1.增加对HTTP代理对域名代理的支持;
---------
2011-8-28
1.源码增加模板系统,站长可轻松自定义浏览器界面;
2.修复邮箱发送网盘附件;
3.修复若干BUG;
---------
2011-8-26
1.修正并完善COOKIE，正规化COOKIE处理;
2.增加后台全局DNS设置;
3.由于改进了COOKIE，所以清空了大家的COOKIES;
---------
2011-8-1
1.修正并完善网络类;
2.修正网盘图片的缩略图;
3.修正图片的显示;
4.官方版地址改为mm.jiuwap.cn;
5.增加NTP校时,可自动校正空间时间为北京时间，误差几秒内
---------
2011-4-31
1.修正核心SOCKET类HTTP1.1通讯里的CHUNK设计BUG导致获取页面不全的问题;
2.修正更新&amp;安装里的部分HTML错误;
---------
2011-4-29
忘记更新什么了,紧急修复一个BUG,可导致浏览器崩溃;
---------
2011-4-21
1.网盘增加新建压缩包(支持zip/jar/mrp格式)功能;<br/>2.优化HTTP协议(由原来的HTTP1.0改为HTTP1.1,增加对chunk的支持,读取数据更全更快);
3.主要是针对MRP、网盘的优化;
---------
2011-4-20
1.网盘增加压缩包(ZIP/JAR/MRP)文件解压后“改名文件、添加文件、删除文件、新建文件夹、打包”的操作。;
2.优化网盘部分代码;
3.修正路径问题导致出现的一些列问题;
4.改进书签同步API(主要针对部分空间修改网页强制添加广告代码后导致格式错误的问题),同步书签双方版本必须大于等于20110420;
---------
2011-4-18
1.网盘可以修改MRP文件的信息,如显示名、版本号、介绍等;
2.优化MRP类,感谢hu60.cn提供技术支持;
3.网盘功能插件化,方便日后增加更多功能;
4.增加API接口,所有玖玩浏览器可以获取其它玖玩浏览器的书签,双方版本必须大于等于20110418,浏览器首页点书签就能看到;
5.修正code.php(查看更多时间代码)PHP报错的BUG
---------
2011-4-17
1.网盘增加MRP的解压缩,mrp解压缩代码由hu60.cn提供,我整合成PHP类了,在源码里有;
2.修改完善网盘文件ICO图标;
---------
2011-4-16
1.修正"修改密码"界面问题;
2.修正注册账号BUG(存在重复账号);
3.修改API函数接口(注册函数);
4.修正网盘阅读DOC的错误,部分文档不支持;
5.开发单文件网络安装脚本,安装玖玩浏览器只需上传一个文件(index.php),首次运行即可自动下载最新玖玩浏览器源码到空间并执行安装,相当方便;
---------
2011-4-4
1.再次修正HTTP协议上传部分;
2.WAP2模式下使用hr元素;
3.增加代理开关,简化部分代码;
4.玖玩浏览器换域名,e.jiuwap.cn;
5.部分浏览器(如MTKQQ浏览器)不支持Button表单按钮,故强制将button转换为input(submit)按钮;
6.修正安装&amp;更新系统,解决无法创建目录等BUG,20110313可直接升级到20110405了,欢迎尝试,如果升级出错,请下载文件<b>http://e.jiuwap.cn/update/20110405/20110405.zip</b>对原文件进行替换,同时执行SQL"<b>ALTER TABLE `browser_users` ADD `config_ipagent_open` TINYINT( 1 ) NOT NULL DEFAULT \'0\';</b>";
---------
2011-4-3
1.修改"网路硬盘"为"网络硬盘";
2.修复"进入网盘上传模式"乱码;
3.修正下载界面文件名的乱码;
4.修正对WAP2/WAP1浏览器的识别;
5.中转下载直接进入下载,去除10分钟内失效提示;
---------
2011-3-12
1.玖玩浏览器安装文件写完了！而且支持自动更新哦！以后可轻松升级到最新版！;
2.修改完善HTTP协议;
---------
2011-3-11
1.修正远程下载文件名的正确获取;
2.剔除内测,任何人可用网盘;
3.我们发现很多人用我们的浏览器程序但是没给我们最起码的“powered by jiuwap.cn”我们很伤心;
---------
2011-1-16
1.玖玩浏览器正式开源,需要源码的朋友请主动联系我。提醒大家;请不要轻易使用别人的浏览器!!!因为:别人可能通过修改浏览器源码盗取用户信息,能盗取的信息不仅仅是账号密码!!也请那些使用我浏览器的人严格保护用户们的隐私等信息!!!官方玖玩浏览器绝对保护用户的利益!!!但我们玖玩网无法保证其他用我们程序的站也同样保护您;
---------
2011-1-15
1.修正Unicode编码解码不全的问题;
2.又将缓存改进mysql数据库了;
3.改善HTTP网络协议(fsockopen),改为Keep-Alive;
4.玖玩浏览器换域名,m.jiuwap.cn;
---------
2011-1-14
1.重构缓存文件结构,不知效率会不会改善,清空了用户所有COOKIE和缓存,不好意思;
2.图片压缩将95%换为80%;
---------
2011-1-3
1.增加对javascript跳转的识别;
2.解决当清理缓存后使用中转下载、传到网盘出现文件不存在的问题;
3.登录时可以保存本地书签免除频繁的登录;
4.增加对onenterbackward跳转的识别;
5.反馈内容长度增加到500字符;
---------
2011-1-2
1.修正部分页面(wml)错误,如wap1模式下转到网盘出错;
2.优化大量模板代码,让源码更简洁;
3.增加对Unicode的解码,部分采用Unicode编码的页面更能节省流量,如139邮箱;
4.完善了访问失败的界面;
5.浏览器下载界面增加对wap1的支持;
6.给WAP转WEB增加了个简单的CSS以解决IE下链接错位的情况;
7.WAP转WEB时,强制去除p标签的元素属性(如居中);
8.弓虽,增加WEB/WAP转WAP1表单上传的网盘上传模式;
9.清空了所有人的缓存,改善了缓存文件;
10.浏览器建议BUG反馈系统上线;
11.修正网盘上传模式对部分页面的兼容问题;
---------
2011-1-1
1.浏览器底部定制增加时间代码;
2.优化部分代码，一时蛋疼忘记记录优化哪里了;
3.修复网盘在线阅读分页BUG;
4.修正上传，部分网页的访问依旧有问题，如ucweb论坛无法登陆，原因是http协议里的长连接(connect)有问题，或许是我还不太会http协议吧;
5.继续优化核心HTTP协议通讯类;
6.修复部分图片的中转、压缩;
7.修复3GQQ宠物XML解析错误;
8.截止此时,浏览器整站源码大小达到755KB(不加图片和缓存);
9.重写了gzip解压缩函数;
10.弓虽，上传文件增加[进入网盘文件上传模式]，可直接将网盘文件传至网页。
---------
2010-12-31
1.网盘在线阅读增加分页,分页字数为1500字符;
2.网盘新建文件与浏览器剪切板整合,可以粘贴剪切板的内容到文件;
3.开放网盘和中转上传给100名会员使用;
4.增加默认自动识别浏览器是否支持wap2;
8.网盘增加python的代码高亮。
';

$str = explode('---------',$str);
$num = count($str);
$apage = 5;
$pa= ceil($num/$apage);


if ( $pa < 1){
    $pa = 1;
}

if ( $p<=0 || $p > $pa ){
    $p = 1;
}

$max = $p * $apage;
if ( $max > $num){
    $max = $num;
}

echo '<br/><a href="http://mm.jiuwap.cn/self/new.php">查看浏览器官方更新日志</a><br/>';


for($i = $max - $apage;$i<$max;$i++){
    $val = str_replace("\n",'<br/>',$str[$i]);
    echo $val.hr;
}

if ( $pa > 1){
    if ( $p < $pa){
        echo '<a href="new.php?p='.($p+1).'">下页</a>';
    }
    if ( $p > 1){
        echo '<a href="new.php?p='.($p-1).'">上页</a>';
    }

}
echo '<br/>'.$apage.'条/页,共'.$num.'条,共'.$pa.'页,第'.$p.'页';
echo hr.'上述更新日志仅供参考,可能有漏掉的。'.hr;
echo '<a href="/">返回</a>';

foot_wap();